/******************************参照LC 209题************************************* */
/******************************参照LC  76题************************************* */
/******************************参照LC 567题************************************* */
/******************************参照LC 438题************************************* */
/******************************参照LC   3题************************************* */


const nonFixedSlidingWindow = (strA, strB) => {

  遍历strB, 去创造frequency map  // map key为字符, value为出现的次数

  let slow = 0;
  let fast = 0;
  let valid = 0;


  while (fast < strA.length) {

    /* 增大窗口： c是将移入窗口的字符 */
    let c = strA[fast];
    //右移窗口
    fast++;
    //进行窗口内数据的一系列更新
    ...

    /*** debug 输出的位置 ***/
    console.log(slow, fast);

    /* 缩小窗口：判断左侧窗口是否要收缩 */
    while(window needs shrink){
      //d是将移出窗口的字符
      let d = strA[slow];
      //左移窗口
      slow++
      //进行窗口内数据的一系列更新
      ...
    }
    
  }

};